//Постановка задачі
//Є магазин "Веселка".В даному магазині продається наступна продукція :
//книжки;
//журнали;
//аудіо диски.
//Всі три види продукції представлені відповідними класами : Книга(Book), Журнал(Megazine), Аудіо диск(Audio).Програма має виводити наступні результати :
//Виводити інформацію про всі книги, журнали і / або аудіо диски.
//Виводити інформацію про найдорожчу книжку, журнал і / або аудіо диск.
//Виводити інформацію про найдешевшу книжку, журнал і / або аудіо диск.
//Виводити середню ціну книг, журналів і / або аудіо дисків.
//Виводити нові книги, журнали і / або аудіо диски.

#include"Rainbow_shop.h"
int main() {


	system("pause");
	return 0;
}